# UV Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
UV Constructor
UV Class See Also
---
Creates a default UV with the values (0, 0).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public UV()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
UV()
```

# See Also
UV Class
UV Overload
Autodesk.Revit.DB Namespace